Revit 2024 API
StructuralSectionSigmaProfileWithFold.TopBendLength Property
 Top Bend segment length.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public double TopBendLength { get; set; }
Visual Basic
Public Property TopBendLength As Double
	Get
	Set
Visual C++
public:
property double TopBendLength {
	double get ();
	void set (double value);
}
See Also
StructuralSectionSigmaProfileWithFold Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace